ghi-electronics/TinyCLR-Ports/Targets/STM32F4/STM32F4_USB.cpp
/*
 * Resume Event Interrupt Handler
 */
void STM32F4_UsbClient_ResumeEvent(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State) {
    OTG->DCTL &= ~OTG_DCTL_RWUSIG; // remove remote wakeup signaling

    State->DeviceState = ((STM32F4_UsbClient_State*)State)->previousDeviceState;

    STM32F4_UsbClient_StateCallback(State);
}

/*
 * Reset Event Interrupt Handler
 */
void STM32F4_UsbClient_ResetEvent(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State) {
    // reset interrupts and FIFOs
    OTG->GINTSTS = 0xFFFFFFFF; // clear global interrupts
    OTG->GRXFSIZ = USB_RXFIFO_SIZE; // Rx Fifo
    OTG->DIEPTXF0 = (USB_TX0FIFO_SIZE << 16) | USB_RXFIFO_SIZE; // Tx Fifo 0
    uint32_t addr = USB_RXFIFO_SIZE + USB_TX0FIFO_SIZE;
    for (int i = 0; i < State->EndpointCount; i++) {
        OTG->DIEPTXF[i] = (USB_TXnFIFO_SIZE << 16) | addr; // Tx Fifo i
        addr += USB_TXnFIFO_SIZE;
        OTG->DIEP[i].INT = 0xFF; // clear endpoint interrupts
        OTG->DOEP[i].INT = 0xFF;
        OTG->DIEP[i].CTL = OTG_DIEPCTL_EPDIS; // deactivate endpoint
        OTG->DOEP[i].CTL = OTG_DOEPCTL_EPDIS;
    }

    // flush FIFOs
    OTG->GRSTCTL = OTG_GRSTCTL_RXFFLSH | OTG_GRSTCTL_TXFFLSH | OTG_GRSTCTL_TXF_ALL;

    // configure control endpoint
    OTG->DIEP[0].CTL = OTG_DIEPCTL_USBAEP; // Tx FIFO num = 0, max packet size = 64
    OTG->DOEP[0].CTL = OTG_DOEPCTL_USBAEP;
    OTG->DIEP[0].TSIZ = 0;
    OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT; // up to 3 setup packets

    // configure data endpoints
    uint32_t intMask = 0x00010001; // ep0 interrupts;
    uint32_t eptype = ((STM32F4_UsbClient_State*)State)->endpointType >> 2; // endpoint types (2 bits / endpoint)
    uint32_t i = 1, bit = 2;
    while (eptype) {
        uint32_t type = eptype & 3;
        if (type != 0) { // data endpoint
            uint32_t ctrl = OTG_DIEPCTL_SD0PID | OTG_DIEPCTL_USBAEP;
            ctrl |= type << 18; // endpoint type
            ctrl |= State->MaxPacketSize[i]; // packet size
            if (State->IsTxQueue[i]) { // Tx (in) endpoint
                ctrl |= OTG_DIEPCTL_SNAK; // disable tx endpoint
                ctrl |= i << 22; // Tx FIFO number
                OTG->DIEP[i].CTL = ctrl; // configure in endpoint
                intMask |= bit; // enable in interrupt
            }
            else { // Rx (out) endpoint
                // Rx endpoints must be enabled here
                // Enabling after Set_Configuration does not work correctly
                OTG->DOEP[i].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | State->MaxPacketSize[i];
                ctrl |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK; // enable rx endpoint
                OTG->DOEP[i].CTL = ctrl; // configure out endpoint
                intMask |= bit << 16; // enable out interrupt
            }
        }
        i++;
        eptype >>= 2;
        bit <<= 1;
    }

    // enable interrupts
    OTG->DIEPMSK = OTG_DIEPMSK_XFRCM; // transfer complete
    OTG->DOEPMSK = OTG_DOEPMSK_XFRCM | OTG_DOEPMSK_STUPM; // setup stage done
    OTG->DAINTMSK = intMask;   // enable ep interrupts
    OTG->GINTMSK = OTG_GINTMSK_OEPINT | OTG_GINTMSK_IEPINT | OTG_GINTMSK_RXFLVLM
        | OTG_GINTMSK_USBRST | OTG_GINTMSK_USBSUSPM | OTG_GINTMSK_WUIM;

    OTG->DCFG &= ~OTG_DCFG_DAD; // reset device address

    /* clear all flags */
    UsbClient_Driver::ClearEvent(0, 0xFFFFFFFF); // clear all events on all endpoints

    State->FirstGetDescriptor = true;

    State->DeviceState = USB_DEVICE_STATE_DEFAULT;
    State->Address = 0;
    STM32F4_UsbClient_StateCallback(State);
}

/*
 * Data Endpoint Rx Interrupt Handler
 */
void STM32F4_UsbClient_EndpointRxInterrupt(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State, uint32_t ep, uint32_t count) {
    ASSERT_IRQ_MUST_BE_OFF();
    uint32_t* pd;

    if (ep == 0) { // control endpoint
        pd = (uint32_t*)((STM32F4_UsbClient_State*)State)->ep0Buffer;
        State->Data = (uint8_t*)pd;
        State->DataSize = count;
    }
    else { // data endpoint
        bool full;
        USB_PACKET64* Packet64 = STM32F4_UsbClient_RxEnqueue(State, ep, full);

        if (Packet64 == 0) {  // should not happen
            USB_DEBUG_ASSERT(0);
        }

        pd = (uint32_t*)Packet64->Buffer;
        Packet64->Size = count;
    }

    // read data
    uint32_t volatile* ps = OTG->DFIFO[ep];
    for (int c = count; c > 0; c -= 4) {
        *pd++ = *ps;
    }
    // data handling & Rx reenabling delayed to transfer completed interrupt
}

/*
 * Data In (Tx) Endpoint Interrupt Handler
 */
void STM32F4_UsbClient_EndpointInInterrupt(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State, uint32_t ep) {
    ASSERT_IRQ_MUST_BE_OFF();

    uint32_t bits = OTG->DIEP[ep].INT;
    if (bits & OTG_DIEPINT_XFRC) { // transfer completed

        OTG->DIEP[ep].INT = OTG_DIEPINT_XFRC; // clear interrupt
    }
    bool done = false;
    if (!(OTG->DIEP[ep].CTL & OTG_DIEPCTL_EPENA)) { // Tx idle

        uint32_t* ps = 0;
        uint32_t count;

        if (ep == 0) { // control endpoint
            if (State->DataCallback) { // data to send
                State->DataCallback(State);  // this call can't fail
                ps = (uint32_t*)State->Data;
                count = State->DataSize;


            }
        }
        else if (State->Queues[ep] != 0 && State->IsTxQueue[ep]) { // Tx data endpoint
            done = true;
            USB_PACKET64* Packet64 = STM32F4_UsbClient_TxDequeue(State, ep, done);

            if (Packet64) {  // data to send
                ps = (uint32_t*)Packet64->Buffer;
                count = Packet64->Size;
            }
        }

        if (ps) { // data to send
            // enable endpoint
            OTG->DIEP[ep].TSIZ = OTG_DIEPTSIZ_PKTCNT_1 | count;
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_EPENA | OTG_DIEPCTL_CNAK;

            // write data
            uint32_t volatile* pd = OTG->DFIFO[ep];
            for (int c = count; c > 0; c -= 4) {
                *pd = *ps++;
            }

            if (done) {
                State->Queues[ep]->erase(State->Queues[ep]->begin());
            }
        }
        else { // no data
            // disable endpoint
            OTG->DIEP[ep].CTL |= OTG_DIEPCTL_SNAK;
        }
    }
}

