ghi-electronics/TinyCLR-Ports/Targets/STM32F4/STM32F4_USB.cpp
/*
 * Handle Setup Data Received on Control Endpoint
 */
void STM32F4_UsbClient_HandleSetup(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State) {
    /* send last setup packet to the upper layer */
    uint8_t result = STM32F4_UsbClient_ControlCallback(State);

    switch (result) {

    case USB_STATE_DATA:
        /* setup packet was handled and the upper layer has data to send */
        break;

    case USB_STATE_ADDRESS:
        /* upper layer needs us to change the address */

        OTG->DCFG |= State->Address << 4; // set device address
        break;

    case USB_STATE_DONE:
        State->DataCallback = 0;
        break;

    case USB_STATE_STALL:
        // setup packet failed to process successfully
        // set stall condition on the control endpoint
        OTG->DIEP[0].CTL |= OTG_DIEPCTL_STALL;
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_STALL;

        // ********** skip rest of function **********
        return;

    case USB_STATE_STATUS:
        break;

    case USB_STATE_CONFIGURATION:
        break;

    case USB_STATE_REMOTE_WAKEUP:
        // It is not using currently as the device side won't go into SUSPEND mode unless
        // the PC is purposely to select it to SUSPEND, as there is always SOF in the bus
        // to keeping the device from SUSPEND.

        break;

    default:
        USB_DEBUG_ASSERT(0);
        break;
    }

    // check ep0 for replies
    STM32F4_UsbClient_EndpointInInterrupt(OTG, State, 0);

    // check all Tx endpoints after configuration setup
    if (result == USB_STATE_CONFIGURATION) {
        for (int ep = 1; ep < State->EndpointCount; ep++) {
            if (State->Queues[ep] && State->IsTxQueue[ep]) {
                STM32F4_UsbClient_EndpointInInterrupt(OTG, State, ep);
            }
        }
    }
}

/*
 * Data Out (Rx) Endpoint Interrupt Handler
 */
void STM32F4_UsbClient_EndpointOutInterrupt(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State, uint32_t ep) {
    ASSERT_IRQ_MUST_BE_OFF();
    uint32_t bits = OTG->DOEP[ep].INT;
    if (bits & OTG_DOEPINT_XFRC) { // transfer completed

        OTG->DOEP[ep].INT = OTG_DOEPINT_XFRC; // clear interrupt
    }

    if (bits & OTG_DOEPINT_STUP) { // setup phase done

        OTG->DOEP[ep].INT = OTG_DOEPINT_STUP; // clear interrupt
    }

    if (ep == 0) { // control endpoint

        // enable endpoint
        OTG->DOEP[0].TSIZ = OTG_DOEPTSIZ_STUPCNT | OTG_DOEPTSIZ_PKTCNT_1 | State->PacketSize;
        OTG->DOEP[0].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;
        // Handle Setup data in upper layer
        STM32F4_UsbClient_HandleSetup(OTG, State);
    }
    else if ((int32_t)(State->Queues[ep]->size()) < ((int32_t)State->Queues[ep]->max_size())) {
        // enable endpoint
        OTG->DOEP[ep].TSIZ = OTG_DOEPTSIZ_PKTCNT_1 | State->MaxPacketSize[ep];
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_EPENA | OTG_DOEPCTL_CNAK;

    }
    else {
        // disable endpoint
        OTG->DOEP[ep].CTL |= OTG_DOEPCTL_SNAK;

    }
}


/*
 * Main Interrupt Handler
 */
void STM32F4_UsbClient_Interrupt(OTG_TypeDef* OTG, USB_CONTROLLER_STATE* State) {
    INTERRUPT_START;

    GLOBAL_LOCK(irq);

    uint32_t intPend = OTG->GINTSTS; // get pending bits

    while (intPend & OTG_GINTSTS_RXFLVL) { // RxFifo non empty
        uint32_t status = OTG->GRXSTSP; // read and pop status word from fifo
        int ep = status & OTG_GRXSTSP_EPNUM;
        int count = (status & OTG_GRXSTSP_BCNT) >> 4;
        status &= OTG_GRXSTSP_PKTSTS;
        if (status == OTG_GRXSTSP_PKTSTS_PR // data received
            || status == OTG_GRXSTSP_PKTSTS_SR // setup received
            ) {
            STM32F4_UsbClient_EndpointRxInterrupt(OTG, State, ep, count);
        }
        else {
            // others: nothing to do
        }
        intPend = OTG->GINTSTS; // update pending bits
    }

    if (intPend & OTG_GINTSTS_IEPINT) { // IN endpoint
        uint32_t bits = OTG->DAINT & 0xFFFF; // pending IN endpoints
        int ep = 0;
        while (bits) {
            if (bits & 1)
                STM32F4_UsbClient_EndpointInInterrupt(OTG, State, ep);
            ep++;
            bits >>= 1;
        }
    }

    if (intPend & OTG_GINTSTS_OEPINT) { // OUT endpoint
        uint32_t bits = OTG->DAINT >> 16; // pending OUT endpoints
        int ep = 0;
        while (bits) {
            if (bits & 1)
                STM32F4_UsbClient_EndpointOutInterrupt(OTG, State, ep);

            ep++;
            bits >>= 1;
        }
    }

    if (intPend & OTG_GINTSTS_USBRST) { // reset
        STM32F4_UsbClient_ResetEvent(OTG, State);
        OTG->GINTSTS = OTG_GINTSTS_USBRST; // clear interrupt
    }
    else {
        if (intPend & OTG_GINTSTS_USBSUSP) { // suspend
            STM32F4_UsbClient_SuspendEvent(OTG, State);
            OTG->GINTSTS = OTG_GINTSTS_USBSUSP; // clear interrupt
        }

        if (intPend & OTG_GINTSTS_WKUPINT) { // wakeup
            STM32F4_UsbClient_ResumeEvent(OTG, State);
            OTG->GINTSTS = OTG_GINTSTS_WKUPINT; // clear interrupt
        }
    }

    INTERRUPT_END;
}

/*
 * OTG FS Interrupt Handler
 */
void STM32F4_UsbClient_FullspeedInterrupt(void* param) {
    STM32F4_UsbClient_Interrupt(OTG_FS, &STM32F4_UsbClient_ControllerState[STM32F4_USB_FS_ID].state);
}

bool STM32F4_UsbClient_Initialize(int controller) {
    if ((uint32_t)controller >= TOTAL_USB_CONTROLLER)
        return false;

    if (!STM32F4_Gpio_OpenPin(STM32F4_USB_DM_PIN(controller)) || !STM32F4_Gpio_OpenPin(STM32F4_USB_DP_PIN(controller)))
        return false;

    if (STM32F4_USB_USE_ID_PIN(controller) && !STM32F4_Gpio_OpenPin(STM32F4_USB_ID_PIN(controller)))
        return false;

    // enable USB clock
    // FS on AHB2
    RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;

    USB_CONTROLLER_STATE *State = &STM32F4_UsbClient_ControllerState[controller].state;

    OTG_TypeDef* OTG = OTG_FS;

    GLOBAL_LOCK(irq);

    // Detach usb port for a while to enforce re-initialization
    OTG->DCTL = OTG_DCTL_SDIS; // soft disconnect

    OTG->GAHBCFG = OTG_GAHBCFG_TXFELVL;     // int on TxFifo completely empty, int off
    OTG->GUSBCFG = OTG_GUSBCFG_FDMOD        // force device mode
        | STM32F4_USB_TRDT << 10   // turnaround time
        | OTG_GUSBCFG_PHYSEL;      // internal PHY

